FinalProject.org
#+TITLE: AI for TNFSH: 從入門到入土
# -*- org-export-babel-evaluate: nil -*-
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../css/muse.css" />
#+INCLUDE: ../pdf.org
#+OPTIONS: ^:nil
#+OPTIONS: toc:2
#+EXCLUDE_TAGS: noexport

#+latex:\newpage

* 決定專題類型
** 資料類型
- 圖形
- 數字
- 文字
- 影音
** 資料來源
*** 網路現成訓練集(X)
- 使用現成資料集分數較低，除非你的實驗設計很有研究價值
*** 自行搜集
- 寫爬蟲程式到各站抓取
- 自已拍照片或手動到網路下載
- 通常無法搜集到足夠數量，需要進行資料擴增

* 決定執行模式
** Colab
- 優點: 支援GPU/TPU，訓練速度快，方便小組合作
- 缺點: 訓練集資料掛載多一道手續；最長訓練時間為12小時
** 本機
- 優點: 資料檔案存取方便
- 缺點: 模型訓練速度不佳

* 需繳交作業
** 專題報告全文
- 格式: 文書處理軟體(word, pages, google document)轉PDF
- 內容:
  1. 研究動機/目的
  2. 實驗設計
  3. 模型效能評估
  4. 小組成員任務分配
  5. 小組成員貢獻評估(每組總分10分，由小組自行分配至各組員)
  6. 學期學習心得(每個組員各寫一段自己的心得)
** 專題期末簡報
- 格式: 簡報軟體轉PDF
- 內容: 摘錄自報告全文

* 相關資源(此為舉例，請自行搜尋其他網路教材)
- [[https://letranger.github.io/DeepLearning/HiCNN.html][Say Hi to CNN]]
- [[https://www.youtube.com/watch?v=PqsTbDxiyBs][Python 期末報告：用deep learning分類心電圖]]
- [[https://hk.releasemind.com/post/academy/use-google-drive-in-colab/][如何在Colab存取Google Drive上的檔案 ─ 掛載及PyDrive 教學]]
- [[https://onway2017.wordpress.com/2020/08/01/%E7%94%A8keras%E5%92%8Ccnn%E5%BB%BA%E7%AB%8B%E6%A8%A1%E5%9E%8B%EF%BC%8C%E8%AD%98%E5%88%A5%E7%A5%9E%E5%A5%87%E5%AF%B6%E8%B2%9D%EF%BC%88%E9%99%84%E4%BB%A3%E7%A2%BC%EF%BC%89/][用Keras和CNN建立模型，識別神奇寶貝-如何訓練自己的資料集]]
- [[https://blog.cavedu.com/2019/07/18/data-augmentation/][Data Augmentation 資料增強]]
