FinalProject.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-11-22 Tue 21:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>AI for TNFSH: 從入門到入土</title>
<meta name="author" content="Yung Chin, Yen" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/muse.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">AI for TNFSH: 從入門到入土</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org725d3cd">1. 決定專題類型</a>
<ul>
<li><a href="#org44b80ab">1.1. 資料類型</a></li>
<li><a href="#org5263614">1.2. 資料來源</a></li>
</ul>
</li>
<li><a href="#org82ca000">2. 決定執行模式</a>
<ul>
<li><a href="#org8ac246d">2.1. Colab</a></li>
<li><a href="#orge235fd5">2.2. 本機</a></li>
</ul>
</li>
<li><a href="#org82db881">3. 需繳交作業</a>
<ul>
<li><a href="#org1ce841b">3.1. 專題報告全文</a></li>
<li><a href="#org051993c">3.2. 專題期末簡報</a></li>
</ul>
</li>
<li><a href="#org180e3b9">4. 相關資源(此為舉例，請自行搜尋其他網路教材)</a></li>
</ul>
</div>
</div>

<div id="outline-container-org725d3cd" class="outline-2">
<h2 id="org725d3cd"><span class="section-number-2">1.</span> 決定專題類型</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org44b80ab" class="outline-3">
<h3 id="org44b80ab"><span class="section-number-3">1.1.</span> 資料類型</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>圖形<br /></li>
<li>數字<br /></li>
<li>文字<br /></li>
<li>影音<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org5263614" class="outline-3">
<h3 id="org5263614"><span class="section-number-3">1.2.</span> 資料來源</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<ol class="org-ol">
<li><a id="org939888e"></a>網路現成訓練集(X)<br />
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li>使用現成資料集分數較低，除非你的實驗設計很有研究價值<br /></li>
</ul>
</div>
</li>
<li><a id="org6ebd1a6"></a>自行搜集<br />
<div class="outline-text-4" id="text-1-2-2">
<ul class="org-ul">
<li>寫爬蟲程式到各站抓取<br /></li>
<li>自已拍照片或手動到網路下載<br /></li>
<li>通常無法搜集到足夠數量，需要進行資料擴增<br /></li>
</ul>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-org82ca000" class="outline-2">
<h2 id="org82ca000"><span class="section-number-2">2.</span> 決定執行模式</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org8ac246d" class="outline-3">
<h3 id="org8ac246d"><span class="section-number-3">2.1.</span> Colab</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>優點: 支援GPU/TPU，訓練速度快，方便小組合作<br /></li>
<li>缺點: 訓練集資料掛載多一道手續；最長訓練時間為12小時<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orge235fd5" class="outline-3">
<h3 id="orge235fd5"><span class="section-number-3">2.2.</span> 本機</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>優點: 資料檔案存取方便<br /></li>
<li>缺點: 模型訓練速度不佳<br /></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org82db881" class="outline-2">
<h2 id="org82db881"><span class="section-number-2">3.</span> 需繳交作業</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org1ce841b" class="outline-3">
<h3 id="org1ce841b"><span class="section-number-3">3.1.</span> 專題報告全文</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>格式: 文書處理軟體(word, pages, google document)轉PDF<br /></li>
<li>內容:<br />
<ol class="org-ol">
<li>研究動機/目的<br /></li>
<li>實驗設計<br /></li>
<li>模型效能評估<br /></li>
<li>小組成員任務分配<br /></li>
<li>小組成員貢獻評估(每組總分10分，由小組自行分配至各組員)<br /></li>
<li>學期學習心得(每個組員各寫一段自己的心得)<br /></li>
</ol></li>
</ul>
</div>
</div>
<div id="outline-container-org051993c" class="outline-3">
<h3 id="org051993c"><span class="section-number-3">3.2.</span> 專題期末簡報</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>格式: 簡報軟體轉PDF<br /></li>
<li>內容: 摘錄自報告全文<br /></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org180e3b9" class="outline-2">
<h2 id="org180e3b9"><span class="section-number-2">4.</span> 相關資源(此為舉例，請自行搜尋其他網路教材)</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="https://letranger.github.io/DeepLearning/HiCNN.html">Say Hi to CNN</a><br /></li>
<li><a href="https://www.youtube.com/watch?v=PqsTbDxiyBs">Python 期末報告：用deep learning分類心電圖</a><br /></li>
<li><a href="https://hk.releasemind.com/post/academy/use-google-drive-in-colab/">如何在Colab存取Google Drive上的檔案 ─ 掛載及PyDrive 教學</a><br /></li>
<li><a href="https://onway2017.wordpress.com/2020/08/01/%E7%94%A8keras%E5%92%8Ccnn%E5%BB%BA%E7%AB%8B%E6%A8%A1%E5%9E%8B%EF%BC%8C%E8%AD%98%E5%88%A5%E7%A5%9E%E5%A5%87%E5%AF%B6%E8%B2%9D%EF%BC%88%E9%99%84%E4%BB%A3%E7%A2%BC%EF%BC%89/">用Keras和CNN建立模型，識別神奇寶貝-如何訓練自己的資料集</a><br /></li>
<li><a href="https://blog.cavedu.com/2019/07/18/data-augmentation/">Data Augmentation 資料增強</a><br /></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yung Chin, Yen</p>
<p class="date">Created: 2022-11-22 Tue 21:28</p>
</div>
</body>
</html>
